//  Задача состоит в расширении функциональности встроенных классов. 
//  Нужно расширить встроенный класс Array следующими методами: square(), sum(), even() и odd().

// square() должен возвращать копию массива в котором каждый элемент возведен в квадрат
// sum() должен возвращать сумму массива в виде числа
// even() должен вернуть массив всех четных чисел
// odd() must return an array of all odd numbers
// Note: инстанс массива (сам массив) изменять не нужно, вы работаете только с клаасом Array

// var numbers = [1, 2, 3, 4, 5]
// numbers.square();  //[1, 4, 9, 16, 25]
// numbers.sum();     //15
// numbers.even();    //[2, 4]
// numbers.odd();     //[1, 3, 5]